Repository: 84000/data-translation-memory
Catalog: toh64-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་གློག་ཐོབ་ཀྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra Vidyutprāpta’s Questions

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all the buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་བྱ་རྒོད་ཕུང་པོའི་རི་ལ། དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ཐམས་ཅད་ཀྱང་ཡོན་ཏན་ཁྱད་པར་དུ་འཕགས་པ་ཕུན་སུམ་ཚོགས་ཤིང་སེང་གེའི་སྒྲ་སྒྲོགས་པ་སྟོང་དང་།
en: The Bhagavān was staying on Gṛdhrakūṭa Mountain in Rājagṛha together with a great assembly of one thousand monks, all of whom had especially exalted qualities and proclaimed the lion’s roar.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྔ་བརྒྱ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: Also in attendance were five hundred bodhisattva mahāsattvas.

source: དེ་དག་ཐམས་ཅད་ཀྱང་གཟུངས་རབ་ཏུ་ཐོབ་པ། སྤོབས་པ་ཐོགས་པ་མེད་པར་གྱུར་པ། མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་མངོན་སུམ་དུ་བྱས་པ། ཕྱིར་མི་ལྡོག་པ་ལ་གནས་པ། ཏིང་ངེ་འཛིན་རྣམས་དང་ལྡན་པ། མངོན་པར་ཤེས་པས་རྣམ་པར་རྩེན་པ། སེམས་ཅན་གྱི་སེམས་ཀྱི་སྤྱོད་པའི་ཚུལ་རབ་ཏུ་རྟོགས་པ་ཤ་སྟག་ལ་༄༅། །འདི་ལྟ་སྟེ།
en: They all had acquired dhāraṇīs, were unobstructed in eloquence, had realized patient acceptance of the nonarising of dharmas, were established in irreversibility, were endowed with samādhis, displayed superior powers in manifold ways, and were completely aware of the way that sentient beings behave mentally.

source: བྱང་ཆུབ་སེམས་དཔའ་ཉི་མའི་རྒྱལ་མཚན་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བའི་རྒྱལ་མཚན་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་འོད་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བའི་རྒྱལ་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཤིན་ཏུ་མཐོ་གསལ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་སྣང་བྱེད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེང་གེའི་བློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེའི་ཡོན་ཏན་འོད་དང་། བྱང་ཆུབ་སེམས་དཔའ་དོན་ཐམས་ཅད་གྲུབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་རྐྱེན་དང་ལྡན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྨོན་ལམ་དང་སྤྱོད་པ་ཕུན་སུམ་ཚོགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པའི་བློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་མཉམ་པའི་སེམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དགའ་སྲེད་དང་། བྱང་ཆུབ་སེམས་དཔའ་འཁོར་ལོ་མོས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་གཡུལ་ལས་རྣམ་པར་རྒྱལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་སྤྱོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་གློག་ཐོབ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་རྒྱལ་བའི་སྤོབས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེང་གེའི་ང་རོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རབ་དབྱངས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སད་བྱེད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྱོད་པ་སྒྱུར་བ་ལ་མཁས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རབ་ཏུ་ཞི་བའི་སྤྱོད་པ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་དག་ནི་གཙོ་བོར་གྱུར་ཏོ། །གཞན་ཡང་བརྒྱ་བྱིན་ལྷའི་དབང་པོ་དང་།
en: The bodhisattva Sūryadhvaja, the bodhisattva Candradhvaja, the bodhisattva Samantaprabha, the bodhisattva Moon King, the bodhisattva Illuminating Heights, the bodhisattva Vairocana, the bodhisattva Siṃhamati, the bodhisattva Precious Light of Virtue, the bodhisattva Sarvārthasiddha, the bodhisattva Possessing Previous Conditions, the bodhisattva Excellent Vows and Conduct, the bodhisattva Wisdom of Emptiness, the bodhisattva Even-Minded, the bodhisattva Joyous Yearning, the bodhisattva Fond of the Multitudes, the bodhisattva Yuddhajaya, the bodhisattva Practice of Wisdom, the bodhisattva Vidyutprāpta, the bodhisattva Victorious Eloquence, the bodhisattva Siṃhanāda, the bodhisattva Most Melodious, the bodhisattva Arousing, the bodhisattva Skilled in Changing Action, and the bodhisattva Practice of Perfect Tranquility—bodhisattva mahāsattvas such as these were at the head.

source: རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པའི་རྒྱལ་པོ་དང་། མཐུ་ཆེན་པོ་དང་ལྡན་པའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་།
en: Furthermore, Śakra, king of the gods, the Four Great Kings, King Brahmā, lord of the Sahā world, and unlimited retinues of gods possessing great power, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas, and others, stayed together with the Bhagavān.

source: མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་ལ་སོགས་པའི་འཁོར་ཚད་མེད་པ་རྣམས་དང་ཡང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ། །དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་གློག་ཐོབ་ཅེས་བྱ་བས་འཁོར་མང་པོ་རབ་ཏུ་ཞི་ཞིང་ཡོངས་སུ་དག་པ་དག་འདུས་པར་གྱུར་པ་མཐོང་བ་དང་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: The bodhisattva Vidyutprāpta saw that the great assembly was gathered, purified, and completely at peace.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: He then got up from his seat, uncovered one shoulder, knelt on his right knee, joined his palms toward the Bhagavān and said to the Bhagavān, “Bhagavān, I am a bit uncertain.

source: བཅོམ་ལྡན་འདས་བདག་ལ་ཐེ་ཚོམ་ཅུང་ཟད་ཅིག་མཆིས་ཏེ་དེང་ཞུ་བར་འཚལ་ན།
en: Now, let me ask you a question.

source: དེ་བཞིན་གཤེགས་པས་ཐུགས་རྗེས་གསན་ཅིང་གནང་བར་མཛད་དུ་གསོལ།
en: May the Tathāgata, listening with compassion, give his consent.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་གློག་ཐོབ་ལ་བཀའ་སྩལ་པ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ཁྱོད་ལ་སྐབས་ཕྱེས།
en: The Bhagavān said to the bodhisattva Vidyutprāpta, “The Tathāgata, Arhat, Samyaksaṃbuddha grants your request.

source: ཁྱོད་ཅི་དང་ཅི་འདོད་པ་དྲིས་ཤིག་དང་ཁྱོད་ལ་ཡང་དག་པར་བསྟན་པར་བྱའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་གློག་ཐོབ་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Ask what you wish.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཇི་ལྟ་བུ་ཞིག་དང་ལྡན་པར་གྱུར་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བགྱིད་ཅིང་སྐྱོན་རྣམས་ཀྱིས་གོས་པར་མི་འགྱུར་བ་དང་།
en: It shall be explained fully.”

source: དབང་པོ་དང་རང་བཞིན་ཇི་ལྟ་བ་བཞིན་དུ་ཐབས་མཁས་པས་སེམས་ཅན་དེ་དག་དྲངས་ཏེ་ལུས་ཞིག་པའི་འོག་ཏུ་ངན་འགྲོ་རྣམས་སུ་ལྟུང་བར་མི་འགྱུར་ཞིང་གདོན་མི་འཚལ་བར་མཉམ་པ་ཉིད་རྟོགས་པར་འགྱུར་བ་དང་། འཇིག་རྟེན་ན་གནས་ཀྱང་པད་མ་བཞིན་སྐྱོན་གྱིས་གོས་པར་མི་འགྱུར་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ལས་མ་གཡོས་པར་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་ཀུན་ཏུ་རྒྱུ་ཞིང་རྟག་པར་དེ་བཞིན་གཤེགས་པའི་གཟུགས་ཀྱི་སྐུ་མཐོང་བ་དང་འབྲལ་བར་མི་འགྱུར་བ་དང་། རྣམ་པར་ཐར་པ་གསུམ་ལ་རབ་ཏུ་གནས་ཀྱང་སྙོམས་པར་མི་འཇུག་པར་སེམས་ཅན་གྱི་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་གི་བཀོད་པ་ཡོངས་སུ་སྦྱངས་ནས་སྐད་ཅིག་མ་གཅིག་ལ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ལགས།
en: The bodhisattva Vidyutprāpta then asked the Bhagavān, “Bhagavān, what attribute do bodhisattvas have that lets them fulfill the desires of all sentient beings while not being sullied by flaws; that lets them lead sentient beings with their skill in means according to those beings’ faculties and their own natures, without their falling into the miserable existences after their bodies are destroyed; that lets them definitely realize equality and, like a lotus, be unsullied by flaws even though they dwell in the world; that lets them not move from the dharmadhātu but wander in the buddha fields, never separated from the sight of the Tathāgata’s form body; that lets them abide in the three liberations and not enter samāpatti; and that lets them, after purifying the array of the buddha fields according to the inclinations of sentient beings, quickly in a single moment be perfectly enlightened in the highest enlightenment?”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གློག་ཐོབ་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཚིགས་སུ་བཅད་དེ་ཞུ་བ་ཞུས་པ། བླ་ན་མ་མཆིས་མི་ཡི་གཙོ། །མཁྱེན་དང་གཟིགས་པ་ཚད་མ་མཆིས། །མ་འདྲེས་ཆོས་ལ་བཞུགས་ནས་ནི། །འཇིག་རྟེན་རྣམས་ལ་ཕན་འདོགས་མཛད། །
en: Then the bodhisattva mahāsattva Vidyutprāpta, in the presence of the Bhagavān, spoke his request in verse: “Unsurpassed lord of humans, Whose wisdom and vision are unlimited, You are established in the unadulterated Dharma And you benefit worldly ones.

source: སེམས་ཅན་ཀུན་ལ་སྙོམས་པར་གཟིགས། །
en: You observe all sentient beings equally.

source: འཇིག་རྟེན་ཀུན་གྱི་མགོན་སྐྱབས་མཛད། །
en: You are the refuge of the world.

source: ལོག་དང་ཡང་དག་ལམ་བསྟན་ནས། །མཐར་ཐུག་བདེ་ལ་འགོད་པར་མཛད། །
en: “Having shown the wrong and the right path, You establish sentient beings in the ultimate happiness.

source: ཡོན་ཏན་མཆོག་ནི་རབ་བསགས་པས། །རིན་ཆེན་སྣ་ཚོགས་ཕུང་པོ་འདྲ། །
en: You have accumulated superior qualities, Like a heap of various jewels.

source: འཇིག་རྟེན་ཤེས་རབ་ཉི་མ་ཁྱོད། །ཁམས་གསུམ་མཆོད་འོས་གཙོ་བོ་ལགས། །
en: You, the sun of wisdom in the world, Are the worthy lord of the three realms.

source: ཐེག་པ་ཆེན་པོ་བཀས་བཤད་ནས། །བྱང་ཆུབ་ལམ་ནི་རྫོགས་པར་མཛོད། །
en: By explaining the Mahāyāna, You have perfected the path of enlightenment.

source: ཞལ་མཚན་ཟླ་བ་ཉ་བ་འདྲ། །
en: “The shape of your face is like the full moon.

source: ཞི་གནས་དག་ནི་ཕུན་སུམ་ཚོགས། །
en: You have completed the calming meditations.

source: ཉེར་ཞི་ཆོས་ནི་རབ་བསྟན་ནས། །ཉོན་མོངས་རྣམས་ནི་ཞི་བར་མཛད། །
en: By proclaiming the teaching of tranquility, You have pacified the afflictions.

source: བྱང་ཆུབ་སྤྱོད་པ་བཀས་བཤད་ནས། །སེམས་ཅན་རྣམས་ལ་ཕན་མཛད་གསོལ། །
en: Please explain the practice of the bodhisattva And benefit sentient beings.

source: སངས་རྒྱས་ཞིང་དང་སྐུ་ཚེ་དང་། །གཟུགས་སྐུ་དང་ནི་འཁོར་རྣམས་དང་། །ཕྲིན་ལས་གསུམ་དང་ཆོས་རྣམས་ཀྱང་། །ཐམས་ཅད་ཀུན་ནི་རྣམ་པར་དག །
en: “His buddha field and lifespan, His form body and assembly, His three actions and dharmas, All are pure.

source: བཅོམ་ལྡན་བྱང་ཆུབ་སེམས་དཔའ་ཡི། །རྣམ་དག་སྤྱོད་པ་བཀས་བཤད་གསོལ། །
en: “Bhagavān, please explain The pure practice of the bodhisattvas.

source: ཇི་ལྟར་བདུད་ནི་གདུལ་བར་བགྱི། །
en: How do they subdue Māra?

source: ཇི་ལྟར་ཆོས་ནི་བསྟན་པར་བགྱི། །
en: How do they teach the Dharma?

source: ཇི་ལྟར་དྲན་པ་ཉམས་མི་འགྱུར། །
en: How is their mindfulness not impaired?

source: ཁྱོད་ཀྱི་བཀས་ནི་བཤད་དུ་གསོལ། །
en: Please explain in your words.

source: ཇི་ལྟར་དཔའ་བོ་དག་གིས་ནི། །འཁོར་བ་ཀུན་དུ་ཞུགས་གྱུར་ཀྱང་། །མཚན་ཉིད་གཅིག་ལ་གནས་བགྱིད་ཅིང་། །ཆོས་ལ་རྟག་ཏུ་གཡོ་མི་འགྱུར། །
en: “As for heroes, Although they are thoroughly engaged in saṃsāra, How are they established in the oneness of characteristics, Never wavering with respect to things?

source: ཇི་ལྟར་སངས་རྒྱས་རྣམས་ལ་ནི། །བསྟན་ཅིང་མཆོད་པ་བགྱིས་ནས་ནི། །རྟག་པར་སངས་རྒྱས་སྐུ་བལྟས་ཀྱང་། །མཐར་ནི་མཚན་མ་སྤོང་འགྱུར་ལགས། །
en: “How do they follow the buddhas And make offerings, And always, even when contemplating the Buddha’s body, Ultimately reject marks?

source: རྣམ་ཐར་གསུམ་པོ་མངོན་བགྱིས་ཀྱང་། །མཁའ་ལ་བྱ་ནི་འཕུར་བ་བཞིན། །ཡོན་ཏན་ཕུན་ཚོགས་མ་གྱུར་པར། །ནམ་ཡང་མྱ་ངན་མི་འདའ་ལགས། །
en: “Although they always realize the three liberations, And are like birds flying in the sky, Their merits are still incomplete, And they never enter nirvāṇa.

source: དབང་པོ་རང་བཞིན་ཡོངས་རྟོགས་ནས། །འཇིགས་པ་མ་མཆིས་རྗེས་འབྲང་ཞིང་། །མངོན་པར་ཞེན་པ་མ་མཆིས་བར། །སེམས་ཅན་དེ་དག་སྨིན་བགྱིད་ལགས། །
en: But they know others’ faculties and natures, And, following them without fear, And without clinging, They make those sentient beings mature.

source: སྔར་ནི་འཇིག་རྟེན་བདེ་བཏང་ནས། །སླད་ཀྱིས་དང་བའི་སེམས་བསྐྱེད་དེ། །
en: “At first, they bestow worldly pleasure; Later, they produce pure minds.

source: ཡེ་ཤེས་གྱ་ནོམ་ཕུན་ཚོགས་པས། །བླ་མེད་བྱང་ཆུབ་འཐོབ་པར་འགྱུར། །
en: Since they are endowed with excellent wisdom, They will attain the highest enlightenment.

source: འདི་འདྲའི་ཟབ་མོ་གྱ་ནོམ་དོན། །དེ་བཞིན་གཤེགས་པས་བཀས་བཤད་གསོལ། །
en: May the Tathāgata explain such a deep and excellent matter.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གློག་ཐོབ་ལ་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་སེམས་ཅན་ཚད་མེད་པ་རྣམས་ལ་ཕན་ཞིང་བདེ་བར་བྱ་བ་དང་། ད་ལྟར་གྱི་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་དང་། མ་འོངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་ལྟ་བུ་ཞུས་པ་ལེགས་སོ་ལེགས་སོ། །
en: The Bhagavān replied to the bodhisattva mahāsattva Vidyutprāpta, “It is good, it is good, that you, son of good family, ask the Tathāgata this sort of thing in order to benefit innumerable sentient beings and make them happy, and to help the beings of the present world, including the gods, and the bodhisattvas of the future.

source: དེའི་ཕྱིར་གློག་ཐོབ་ཤིན་ཏུ་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ཁྱོད་ལ་ཡང་དག་པར་བསྟན་པར་བྱའོ། །
en: Therefore, Vidyutprāpta, listen very carefully and keep this in mind. It will be fully explained to you.”

source: བྱང་ཆུབ་སེམས་དཔའ་གློག་ཐོབ་ཀྱིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་ཐོས་པར་འཚལ་ལོ་ཞེས་གསོལ་པ་དང་།
en: “Bhagavān, I wish to listen in this way,” replied the bodhisattva Vidyutprāpta.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གློག་ཐོབ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་གཏེར་ཆེན་པོ་དང་། ཟད་མི་ཤེས་པའི་གཏེར་དང་། ཀུན་དུ་ཟད་མི་ཤེས་པའི་གཏེར་དང་། མཐའ་མེད་པའི་གཏེར་རྣམ་པ་ལྔ་དང་ལྡན་པ་སྟེ།
en: “Vidyutprāpta,” said the Bhagavān, “the bodhisattva mahāsattvas have five treasures, which are great treasures, inexhaustible treasures, totally inexhaustible treasures, and limitless treasures.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟ་བུའི་གཏེར་ཕུན་སུམ་ཚོགས་པར་གྱུར་པས་རྒུད་པ་རྣམས་གཏན་དུ་སྤོང་ཞིང་གོང་དུ་བསྟན་པ་ལྟ་བུའི་ཡོན་ཏན་ཁྱད་པར་དུ་འཕགས་པ་ཡང་ཡོངས་སུ་རྫོགས་པར་བྱེད་ལ་ཚེགས་ཆུང་ངུས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་འཐོབ་པར་འགྱུར་རོ། །
en: When bodhisattvas are completely endowed with such treasures, they are completely free from misfortune, they completely perfect especially superior virtues of the sort mentioned above, and quickly obtain with little difficulty superior, perfect enlightenment.

source: ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are the five?

source: འདོད་ཆགས་སྤྱོད་པའི་གཏེར་དང་། ཞེ་སྡང་སྤྱོད་པའི་གཏེར་དང་། གཏི་མུག་སྤྱོད་པའི་གཏེར་དང་། ཆ་མཉམ་པ་སྤྱོད་པའི་གཏེར་དང་། ཆོས་ཐམས་ཅད་ཀྱི་གཏེར་གང་ཡིན་པའོ། །
en: They are the treasure for those with a lustful temperament, the treasure for those with an angry temperament, the treasure for those with a deluded temperament, the treasure for those with an equally proportioned temperament, and the treasure of all dharmas.

source: གློག་ཐོབ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་འདོད་ཆགས་སྤྱོད་པའི་གཏེར་ཞེས་བྱ་བ་ཇི་ལྟ་བུ་ཡིན་ཞེ་ན། འདི་ལྟ་སྟེ། སེམས་ཅན་རྣམས་ནི་འདོད་ཆགས་ཀྱི་སྤྱོད་པའི་རྗེས་སུ་འཐུན་ཞིང་ཕྱིན་ཅི་ལོག་གིས་བཅིངས་པས་མཚན་མ་རྣམས་ཀྱི་རྗེས་སུ་གཟུགས་དང་། སྒྲ་དང་།
en: “Vidyutprāpta, what is the bodhisattva mahāsattvas’ treasure for those with a lustful temperament?

source: དྲི་དང་། རོ་དང་། རེག་བྱ་དང་། ཆོས་ལ་སོགས་པའི་ཡུལ་དག་ལ་རྣམ་པ་སྣ་ཚོགས་སུ་རྣམ་པར་བརྟགས་ནས་བརྟན་པ་ཉིད་དུ་མངོན་པར་ཞེན་པ་དང་། བདེ་བ་ལ་ཆགས་ཤིང་མྱོས་པར་གྱུར་པ་ཡིན་ལ། བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་དེ་དག་གི་སེམས་ཀྱི་སྤྱོད་པ་རྣམ་པ་སྣ་ཚོགས་གང་ཡིན་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པས་སེམས་ཅན་དེ་དག་གང་ལ་མོས་ཤིང་འདུན་པ་དང་།
en: Sentient beings who belong to the group of those with a lustful temperament are bound by false views and falsely impute various things, according to their natures, to objects such as forms, sounds, smells, tastes, objects of touch, and mental objects, cling to them steadfastly, and are intoxicated in their attachment to pleasure.

source: སྤྱོད་ཡུལ་གང་ལ་ཆགས་ཤིང་གོམས་པས་མཐུ་ཅན་དུ་གྱུར་པ་དང་། དད་པ་ཇི་ལྟ་བུ་དང་ལྡན་ཞིང་ཕུན་སུམ་ཚོགས་པར་གྱུར་པ་དང་། སྔོན་དགེ་བའི་རྩ་བ་ཇི་ལྟ་བུ་བསྐྱེད་པ་དང་། ཐེག་པ་གང་ལ་གཞོལ་བར་བྱེད་པ་དང་། དགེ་བའི་རྩ་བ་ཇི་སྙེད་ཡོད་པ་དག་ནམ་ཞིག་ན་ཡོངས་སུ་སྨིན་པར་གྱུར་པ་ཡང་རབ་ཏུ་ཤེས་ཏེ།
en: The bodhisattva mahāsattvas, by knowing in accordance with truth the mental temperament of those beings, understand what they believe and desire, what objects they cultivate and are attached to, how powerful they are and what sort of faith they are endowed with, what sorts of virtuous roots they have produced, to what vehicle they should devote themselves, and when their virtuous roots will mature.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་དེ་དག་གི་འདོད་པ་ཐམས་ཅད་ཡོངས་སུ་སྤང་བའི་ཕྱིར་དང་། དེ་དག་གི་དགེ་བའི་སེམས་རྟག་པར་རྒྱུན་མི་འཆད་པར་བྱ་བའི་ཕྱིར་ཤིན་ཏུ་ལེགས་པར་བརྟགས་ནས་ཡོངས་སུ་གསོ་བར་བྱེད་དེ།
en: The bodhisattva mahāsattvas, for the sake of eliminating all the desires of those sentient beings, and for the sake of making sure that their minds are always uninterruptedly virtuous, evaluate them very carefully and nourish them completely.

source: གློག་ཐོབ་སེམས་ཅན་རྣམས་ཀྱི་དབང་པོ་དང་། སྤྱོད་པའི་བྱེ་བྲག་ནི་ཤིན་ཏུ་ཤེས་པར་དཀའ་བར་རིག་པར་བྱ་སྟེ།
en: “Vidyutprāpta, it should be understood that the differences in the faculties and temperaments of sentient beings are very difficult to know.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཀྱང་རིག་པར་མི་ནུས་ན་སོ་སོའི་སྐྱེ་བོ་དང་། མུ་སྟེགས་ཅན་རྣམས་ཀྱིས་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: Śrāvakas and pratyekabuddhas cannot understand them, let alone ordinary people or heretics.

source: གློག་ཐོབ་སེམས་ཅན་ཁ་ཅིག་ནི་འདོད་པ་རྣམས་ལ་མངོན་པར་ཞེན་པར་གྱུར་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་ཡང་ཡོད་དོ། །
en: Vidyutprāpta, some sentient beings, even though they are attached to objects of desire, mature in unsurpassable, perfect enlightenment.

source: སེམས་ཅན་ཁ་ཅིག་ནི་འདོད་པའི་ཡུལ་ལ་རེག་པ་ཙམ་འམ། འདོད་པའི་སེམས་ཀྱིས་ཚིག་སྨྲས་པ་ཙམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་ཡང་ཡོད་དོ། །
en: Some sentient beings, just by having contact with a desired object or just by speaking with a lustful mind, mature in unsurpassable, perfect enlightenment.

source: སེམས་ཅན་ཁ་ཅིག་ནི་གཟུགས་སྡུག་གུ་དག་མཐོང་ནས་འདོད་ཆགས་ཀྱི་སེམས་སྐྱེས་པ་ལས་གཟུགས་དེ་རྣམ་པར་འགྱུར་ཞིང་ཞིག་པར་མཐོང་བ་ཉིད་ཀྱིས་གཟུགས་མི་རྟག་པར་ཁོང་དུ་ཆུད་པར་གྱུར་ནས་འདོད་པའི་གདུང་བ་ཉེ་བར་ཞི་སྟེ།
en: Some sentient beings look at a beautiful form and, although a lustful thought arises, understand, just by seeing that form deteriorating and being destroyed, that the form is impermanent, and the torment of their desire is calmed.

source: མི་རྟག་པ་ཉིད་ཤིན་ཏུ་ཡིད་ལ་བྱེད་པ་ཉིད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་ཡང་ཡོད་དོ། །
en: Just by means of the utmost contemplation of impermanence, they mature in unsurpassable, perfect enlightenment.

source: སེམས་ཅན་ཁ་ཅིག་ནི་བུད་མེད་མཐོང་བ་ན་མངོན་པར་ཞེན་པ་སྐྱེས་བ་མེད་ཀྱང་ཕྱིས་ཡིད་ལ་དྲན་པའི་དབང་གིས་འདོད་ཆགས་ཀྱི་སེམས་སྐྱེས་ནས་དེའི་ཁ་དོག་དང་དབྱིབས་ཡིད་ལ་བྱས་ནས་རྗེས་སུ་ཆགས་པ་སྐྱེ་བར་འགྱུར་བ་ཡང་ཡོད་དོ། །
en: “As for some other sentient beings, when they see a woman, desire does not arise, but afterward, through the power of memory, a sexual thought arises, and when they remember her complexion and figure, passion arises.

source: སེམས་ཅན་ཁ་ཅིག་ནི་རྨི་ལམ་ན་གཟུགས་ཡིད་དུ་འོང་བ་རྣམས་མཐོང་བའི་དབང་གིས་འདོད་ཆགས་ཀྱི་མངོན་པར་ཞེན་པ་སྐྱེས་ནས་ཡིད་ལ་བྱེད་ཅིང་ཡོངས་སུ་གཉེར་བར་བྱེད་པ་ཡང་ཡོད་དོ། །
en: As for some other sentient beings, due to their seeing pleasing shapes in a dream, sexual attachment arises, and, fixating on them, they pursue them.

source: སེམས་ཅན་ཁ་ཅིག་ནི་བུད་མེད་ཀྱི་སྒྲ་ཐོས་པ་ཙམ་གྱིས་འདོད་ཆགས་ཀྱི་སྲེད་པ་སྐྱེད་པར་བྱེད་ལ།
en: As for some other sentient beings, just hearing a woman’s voice produces sexual desire.

source: རེས་འགའ་ནི་མཐོང་བ་ཙམ་གྱིས་འདོད་ཆགས་ཀྱི་སེམས་དང་བྲལ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་ཡང་ཡོད་པས།
en: And some, freed from sexual thought that is due to a mere glance, mature in unsurpassable, perfect enlightenment.

source: དེའི་ཕྱིར་གློག་ཐོབ་བྱང་ཆུབ་སེམས་དཔའ་ནི་འདོད་ཆགས་ཀྱི་ནད་རྣམ་པ་སྣ་ཚོགས་གང་ཡིན་པ་དང་། འདོད་ཆགས་ཀྱི་སྨན་རྣམ་པ་སྣ་ཚོགས་གང་ཡིན་པ་དེ་དག་ཐབས་མཁས་པས་ལེགས་པར་ཁོང་དུ་ཆུད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་ལ་གཉིས་སུ་འཛིན་པའི་མཚན་མ་ཡང་མེད་ལ། ཆོས་ཀྱི་དབྱིངས་ལ་རྨོངས་པར་གྱུར་པའི་སེམས་ཅན་དེ་དག་ལ་ཡང་སྙིང་རྗེ་ཆེན་པོ་སྐྱེད་པར་བྱེད་དོ། །གློག་ཐོབ་འདོད་ཆགས་དང་།
en: “Therefore, Vidyutprāpta, although the bodhisattvas know, with their skillful means, those various illnesses of desire and the various remedies for desire, they lack signs of grasping at dualism in the dharmadhātu, and they produce great compassion even for those beings who are confused regarding the dharmadhātu.

source: ཞེ་སྡང་དང་། གཏི་མུག་ཅེས་བྱ་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཡེ་ཤེས་ཞེས་བྱ་བའི་ཆོས་ཅུང་ཟད་ཙམ་ཡང་དམིགས་སུ་མེད་པས་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་བདག་གིས་མཐོང་བ་ལྟར་ན་སེམས་ཅན་རྣམས་ནི་མཚན་མ་མེད་པ། རང་བཞིན་གྱིས་སྟོང་ཞིང་དབེན་པ། བཏགས་པ་ཙམ་དུ་རྣམ་པར་གཞག་པ་ཚོགས་ཤིང་འདུས་པའི་ཆོས་འདི་ལ་འདོད་ཆགས་དང་།
en: Vidyutprāpta, since not even the slightest thing called love, hatred, delusion, or wisdom regarding the dharmadhātu can be apprehended, the bodhisattva thinks, ‘If it is as I see it, sentient beings produce desire, hatred, and delusion toward these compounded things that are collections established as mere designations, without marks, empty of inherent existence, and void.

source: ཞེ་སྡང་དང་། གཏི་མུག་སྐྱེད་པར་བྱེད་པས་བདག་གིས་འདི་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སོ་སོར་བརྟགས་ནས་འདོད་ཆགས་ཀྱིས་རྨོངས་པར་གྱུར་པའི་སེམས་ཅན་དེ་དག་གི་ཆེད་དུ་སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་ནས་སྔོན་གྱི་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱའོ། །
en: After analyzing these things as they really are, dwelling in great compassion for those sentient beings who are bewildered by desire, I will fulfill my former vows.

source: ཆོས་ཀྱི་དབྱིངས་ལས་མ་གཡོས་པར་རྩོལ་བ་མེད་པའི་ཡེ་ཤེས་ཀྱིས་ཡོངས་སུ་སྨིན་པར་བྱའོ་སྙམ་དུ་སེམས་སོ། །
en: Without wavering from the dharmadhātu, I will make them mature by means of my effortless wisdom.’

source: སྐྱེས་པ་གང་ཞིག་བུད་མེད་དག་ལ་ཡང་དག་པ་མ་ཡིན་པས་སྡུག་པའི་འདུ་ཤེས་བསྐྱེད་ནས་འདོད་ཆགས་ལྕི་བ་སྐྱེས་པར་གྱུར་ན། བྱང་ཆུབ་སེམས་དཔས་བུད་མེད་ཤིན་ཏུ་སྡུག་ཅིང་མཛེས་པ། གཟུགས་ཀྱི་མཚན་ཁྱད་པར་དུ་འཕགས་པ། རིན་པོ་ཆེའི་རྒྱན་ཕྲེང་དང་ལྡན་པ།
en: “If a man mistakenly believes that women are pure, and if this gives rise to deep desire, the bodhisattva will turn himself into a very beautiful, elegant woman, whose physical characteristics are especially outstanding, and who, like apsaras, possesses precious ornaments and garlands, never before seen, and is well adorned with various ornaments.

source: རྒྱན་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་བརྒྱན་པས་ལྷའི་བུ་མོ་དང་འདྲ་བར་གྱུར་པ་སྔོན་མ་མཐོང་བ་དག་ཏུ་བསྒྱུར་ནས་སེམས་ཅན་དེ་དག་གིས་ཇི་ལྟར་སྲེད་ཅིང་རྗེས་སུ་ཆགས་པ་དང་། ཤིན་ཏུ་མངོན་པར་ཞེན་པར་གྱུར་པ་སྟོན་པར་བྱེད་དེ། དེ་དག་གི་ནུས་པ་དང་སྦྱར་ནས་ཐབས་ཀྱིས་འདོད་ཆགས་ཀྱི་དུག་མདའ་དབྱུང་བའི་ཆེད་དུ་རང་དབང་དུ་གྱུར་པའི་མཐུས་བུད་མེད་ཀྱི་གཟུགས་སུ་བསྒྱུར་ནས་དེའི་མདུན་དུ་སྣང་བར་བྱས་ནས་ཆོས་བསྟན་པ་ཉིད་ཀྱིས་སེམས་ཅན་དེ་དག་ཆོས་ཀྱི་དབྱིངས་རྟོགས་པར་བྱས་ཏེ་མི་སྣང་བར་འགྱུར་རོ། །
en: With that sentient being having shown how lustful, passionate, and very obsessed he is, the bodhisattva, with a method adjusted to the ability of that sentient being, in order to remove the poison arrow of lust, by means of his unimpeded power, having previously changed into the shape of a woman, then appears again before him.

source: བུད་མེད་གང་ཞིག་སྐྱེས་པ་དག་ལ་འདོད་ཆགས་ཀྱི་སེམས་སྐྱེས་པར་གྱུར་ན་བྱང་ཆུབ་སེམས་དཔས་སྐྱེས་པའི་ལུས་བསྟན་ནས་འདོད་ཆགས་ཀྱི་དུག་མདའ་དབྱུང་བའི་ཆེད་དུ་ཆོས་བསྟན་པ་ཉིད་ཀྱིས་ཆོས་ཀྱི་དབྱིངས་ལ་ཞུགས་པར་བྱས་ནས་མི་སྣང་བར་བྱེད་དོ། །
en: Having made that sentient being understand the dharmadhātu by his teaching of the Dharma, the bodhisattva will disappear. If a woman gives rise to a desirous thought about men, the bodhisattva appears in the body of a man. In order to remove the poison arrow of lust, he makes her understand the dharmadhātu by teaching the Dharma, and he disappears.

source: གློག་ཐོབ་འདོད་ཆགས་ཀྱི་སྤྱོད་པ་ཉི་ཁྲི་ཆིག་སྟོང་དང་།
en: “Vidyutprāpta, there are twenty-one thousand lustful actions and, with the addition of those other actions, there are eighty-four thousand actions in total.

source: སྤྱོད་པ་གཞན་དེ་དག་ཀྱང་གཏོགས་པར་བརྒྱད་ཁྲི་བཞི་སྟོང་དུ་གྱུར་པ་དེ་དག་བྱང་ཆུབ་སེམས་དཔས་རྩོལ་བ་མེད་པའི་ཡེ་ཤེས་ཀྱིས་ཆོས་ཀྱི་སྒོ་མོ་བྱེ་བ་སྟོང་ཕྲག་ཚད་མེད་པ་བསྐྱེད་དེ།
en: The bodhisattvas, with their effortless wisdom, produce countless thousands of open Dharma doors.

source: སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཁོང་དུ་ཆུད་པར་བྱས་ནས་ཐམས་ཅད་རྣམ་པར་གྲོལ་བར་གྱུར་ཀྱང་བདག་གིས་སེམས་ཅན་དག་ལ་འདི་ལྟ་བུའི་ཆོས་བསྟན་ཏོ་སྙམ་དུ་སེམས་པ་ཡང་མེད་ལ། སེམས་ཅན་རྣམ་པར་གྲོལ་བར་གྱུར་པ་ཡང་མི་དམིགས་སོ། །
en: The minds of sentient beings having been penetrated, they all become liberated, even though the bodhisattvas do not have the thought, ‘I teach this sort of Dharma to sentient beings,’ and they do not imagine that beings are liberated.

source: གློག་ཐོབ་འདི་ལྟ་སྟེ་དཔེར་ན་མཚོ་མ་དྲོས་པའི་ཀླུའི་རྒྱལ་པོ་ནི་ལས་ཀྱི་མཐུའི་དབང་གིས་དེའི་ཕོ་བྲང་གི་ནང་ནས་ཆུ་ཀླུང་ཆེན་པོ་བཞི་བྱུང་ནས་སེམས་ཅན་ཆུ་དང་སྐམ་ལ་གནས་པ་དག་དབྱར་ཚ་བའི་དུས་ཀྱི་ཚེ་བསིལ་བ་དང་།
en: “Vidyutprāpta, to give an analogy, the nāga king of Lake Anavapta, due to the force of karma, releases four great rivers from inside his palace and cools the summer heat.

source: རླན་གྱིས་མེ་ཏོག་དང་། འབྲས་བུ་དག་རྒྱས་ཤིང་འབྲུ་རྣམས་འཕེལ་བར་གྱུར་ནས་སེམས་ཅན་མང་པོ་ཤིན་ཏུ་བདེ་བར་བྱེད་ཀྱང་།
en: With the moisture, he makes the flowers and the fruits grow and the grains increase and greatly pleases many sentient beings.
